{
    "personages": [
        {
            "role": "master",
            "name": "Receptionist"
        }, {
            "role": "pupil",
            "name": "Mr Kent"
        }
    ],
    "steps": [{
        "id": 1,
        "start_personage": "pupil",
        "master": {
            "number": 1,
            "variants": [
                {
                    "task": "Да, сэр. Как вы сказали ваша фамилия?",
                    "phrase" : "Yes, sir. What did you say the name was, sir?",
                    "next_step": 2,
                    "prev_step": -1
                }
            ]
            
        },
        "pupil": {
            "number": 1,
            "variants": [
                {
                    "task": "Добрый вечер. Моя фамилия Кент. Я заказывал номер на прошлой неделе для себя и своей семьи.",
                    "phrase": "Good evening. My name is Kent. I booked a room last week for my family and myself.",
                    "next_step": 2,
                    "prev_step": -1
                }
            ]
        }
    }, {
        "id": 2,
        "start_personage": "pupil",
        "master": {
            "number": 2,
            "variants": [
                {
                    "task": "Ах да, вот оно. Да - мы получили ваше письмо. Номера 11 и 12. Если вы подпишетесь в журнале регистраций я попрошу носильщика  показать вам номер и помочь вам с багажом.",
                    "phrase" : "Ah yes – here we are, sir. Yes – we got your letter. Rooms 11 and 12. If you’ll sign the register, I’ll ask the porter to show you the rooms and help you with your luggage.",
                    "next_step": 3,
                    "prev_step": 1
                }
            ]
        },
        "pupil": {
            "number": 2,
            "variants": [
                {
                    "task": "Кент. Я просил два двухместных номера - один для моей жены и меня и второй для двоих детей.",
                    "phrase": "Kent. I asked for two double rooms – one for my wife and myself and one for the two children.",
                    "next_step": 3,
                    "prev_step": 1
                }
            ]
        }
    }, {
        "id": 3,
        "start_personage": "pupil",
        "master": {
            "number": 3,
            "variants": [
                {
                    "task": "Вот здесь, сэр - полное имя, домашний адрес, дата и подпись.",
                    "phrase" : "Just here, sir – full name, home address, date and signature.",
                    "next_step": 4,
                    "prev_step": 2
                }
            ]
        },
        "pupil": {
            "number": 3,
            "variants": [
                {
                    "task": "Спасибо. Где мне расписаться?",
                    "phrase": "Thank you. Where do I sign?",
                    "next_step": 4,
                    "prev_step": 2
                }
            ]
        }
    }, {
        "id": 4,
        "start_personage": "pupil",
        "master": {
            "number": 4,
            "variants": [
                {
                    "task": "Спасибо, сэр. Я надеюсь, вам понравяться номера. В одном из них есть ванная комната. Во второй, я боюсь, нет, но есть ванная комната совсем рядом по корридору. В каждом номере есть радио, и, конечно, обслуживание номеров доступно по телефону.",
                    "phrase" : "Thank you, sir. I think you’ll find the rooms comfortable. One of them has a bathroom. The other hasn’t I’m afraid, but there’s a bathroom very near – just along the corridor. There’s a radio in each room and of course if you want Room Service just use the telephone.",
                    "next_step": 5,
                    "prev_step": 3
                }
            ]
        
        },
        "pupil": {
            "number": 4,
            "variants": [
                {
                    "task": "Готово",
                    "phrase": "Right – there we are.",
                    "next_step": 5,
                    "prev_step": 3
                }
            ]
        }
    }, {
        "id": 5,
        "start_personage": "pupil",
        "master": {
            "number": 5,
            "variants": [
                {
                    "task": "Ужин с 18.30 до 21.30. Завтраки мы накрываем начиная с 7.30 утра и вы так же можете заказать чай в номер с 6.30 если пожелаете. Столовая находиться вон там.",
                    "phrase" : "Dinner is from 6.30 until 9.30. We start serving breakfast at 7.30 in the morning and you can have morning tea in your room if you wish - from 6.30 onwards. ... You’ll find the dining-room just over there.",
                    "next_step": 6,
                    "prev_step": 4
                }
            ]
        },
        "pupil": {
            "number": 5,
            "variants": [
                {
                    "task": "Что насчет приемов пищи? Мы хотели бы ужин и завтрак до нашего ухода.",
                    "phrase": "Yes – now what about meal times? We’d like dinner of course – and breakfast in the morning before we leave.",
                     "next_step": 6,
                     "prev_step": 4
                 }
            ]
        }
    }, {
        "id": 6,
        "start_personage": "pupil",
        "master": {
            "number": 6
        },
        "pupil": {
            "number": 6,
            "variants": [
                {
                    "task": "Большое спасибо.",
                    "phrase": "Thank you very much.",
                    "next_step": -1,
                    "prev_step": 5
                }
            ]
        }
    }]
}